In [1]:
import numpy as np
import pandas as pd
import datetime

In [2]:
df = pd.DataFrame(
    {
        "col1": ["one", "one", "two", "three"] * 3,
        "col2": ["A", "B", "C"] * 4,
        "col3": range(12),
    }
)
df #.head()

     col1 col2  col3
0     one    A     0
1     one    B     1
2     two    C     2
3   three    A     3
4     one    B     4
5     one    C     5
6     two    A     6
7   three    B     7
8     one    C     8
9     one    A     9
10    two    B    10
11  three    C    11

In [9]:
# that's pretty standard...
df.groupby('col1').size()

col1
one      6
three    3
two      3
dtype: int64

In [10]:
# that performs sum over all other cols than col1 -> probably not what we want...
# df.groupby('col1').sum()

# this is probably more what's required
df.groupby('col1')['col3'].sum()

col1
one      27
three    21
two      18
Name: col3, dtype: int64

In [11]:
df.groupby(['col1', 'col2'])['col3'].sum()

col1   col2
one    A        9
       B        5
       C       13
three  A        3
       B        7
       C       11
two    A        6
       B       10
       C        2
Name: col3, dtype: int64

In [19]:
# we can also use more than one aggregation function...
df.groupby('col1')['col3'].agg(['sum', 'max'])

       sum  max
col1
one     27    9
three   21   11
two     18   10